### 1. 데이터셋이 왼쪽과 같을 때, 오른쪽과 같은 결과값을 출력하기 위해 가장 적합한 코드를 고르시오.

In [1]:
import pandas as pd
import numpy as np

data = {1: [np.nan, 100.0, np.nan, 3.0, 3.0],
        2: [2.0, 5.0, np.nan, 3.0, 4.0],
        3: [np.nan, np.nan, np.nan, np.nan, 0.0],
        4: [0, 1, 3, 1, 1]}

df = pd.DataFrame(data)
df

       1    2    3  4
0    NaN  2.0  NaN  0
1  100.0  5.0  NaN  1
2    NaN  NaN  NaN  3
3    3.0  3.0  NaN  1
4    3.0  4.0  0.0  1

1. df.dropna() 
2. df[df.isnull()] 
3. df.dropna(thresh=3) 
4. df.dropna (how='all')

> 답 : 3

In [2]:
df.dropna(thresh=3)

       1    2    3  4
1  100.0  5.0  NaN  1
3    3.0  3.0  NaN  1
4    3.0  4.0  0.0  1

### 2. 다음과 같은 수식을 사용하여 데이터 스케일링을 실시한다. 이때 A열에 있는 각 값에 대해 기대되는 값으로 맞는 것은 무엇인가?

$z_i=\frac{x_i-min(x)}{max(x)-min(x)}(new_{max}-new_{min})+new_{max}$

In [5]:
data = {'A': [14.00, 90.20, 90.95, 96.27, 91.21],
        'B': [103.02, 107.26, 110.35, 114.23, 114.68],
        'C': ['big', 'small', 'big', 'small', 'small']}

df = pd.DataFrame(data)
df

       A       B      C
0  14.00  103.02    big
1  90.20  107.26  small
2  90.95  110.35    big
3  96.27  114.23  small
4  91.21  114.68  small

> 답 : 4

__3. 스케일링 전략 중 z-스코어 정규화(Z-score normalization)와 최솟값-최댓값 정규화(min-max normalization)의 차이점에 대해서 잘못 설명한 것을 고르시오.__

1. 최솟값-최댓값 정규화는 최댓값과 최솟값을 사용자가 지정할 수 있으며 지정하지 않을 경우 0에서 1까지의 값을 가진다.
2. z-스코어 정규화는 값이 최솟값-최댓값 정규화에 비해 음수가 될 수 있다.
3. 최솟값-최댓값 정규화와 z-스코어 정규화는 적용 방법에 따라 값이 달라질 수 있다.
4. 최솟값-최댓값 정규화를 적용할 경우 이상치 여부를 사전에 확인해야 하며, 이상치가 있을 경우 제거해주는 것이 좋다.

> 답 : 4  
> 스케일링은 데이터 간 범위를 맞춤

__4. 다음과 같은 데이터셋이 있다. 빈칸에 코드를 실행했을 때 결과값이 다른 것을 고르시오.__

In [ ]:
edges = pd.DataFrame({'source': [0, 1, 2], 'target': [2, 2, 3],
                      'weight': [3, 4, 5], 'color': ['red', 'blue', 'blue']})
edges

   source  target  weight color
0       0       2       3   red
1       1       2       4  blue
2       2       3       5  blue

1. pd.get_dummies(edges).iloc[:, 3:]
2. pd.get_dummies(edges["color"])
3. pd.get_dummies(edges[["color"]])
4. pd.get_dummies(edges["color"], prefix="color")

> 답 : 2

In [ ]:
pd.get_dummies(edges).iloc[:, 3:]

   color_blue  color_red
0           0          1
1           1          0
2           1          0

In [ ]:
pd.get_dummies(edges["color"])

   blue  red
0     0    1
1     1    0
2     1    0

In [ ]:
pd.get_dummies(edges[["color"]])

   color_blue  color_red
0           0          1
1           1          0
2           1          0

In [ ]:
pd.get_dummies(edges["color"], prefix="color")

   color_blue  color_red
0           0          1
1           1          0
2           1          0

__5. 다음 코드를 실행할 경우 예상되는 결과값을 적으시오.__

```
답 :

first_name       1  
last_name        1  
age              1  
sex              1  
preTestScore     2  
postTestScore    2  
dtype: int64
```

In [ ]:
raw_data = {'first_name': ['Jason', np.nan, 'Tina', 'Jake', 'Amy'],
            'last_name': ['Miller', np.nan, 'Ali', 'Milner', 'Cooze'],
            'age': [42, np.nan, 36, 24, 73], 'sex': ['m', np.nan, 'f', 'm', 'f'],
            'preTestScore': [4, np.nan, np.nan, 2, 3],
            'postTestScore': [25, np.nan, np.nan, 62, 70]}

df = pd.DataFrame(raw_data, columns=[
    'first_name', 'last_name', 'age', 'sex',
    'preTestScore', 'postTestScore'])

df.isnull().sum()

first_name       1
last_name        1
age              1
sex              1
preTestScore     2
postTestScore    2
dtype: int64

__6. 다음과 같은 titanic 데이터의 결측값을 확인하는 코드를 작성하고자 한다.__  
__이때 데이터가 df에 저장 되어 있다고 할 때 빈칸에 들어갈 함수를 선택하시오.__

In [ ]:
train_df = pd.read_csv('../Data/titanic/train.csv')

train_df.index = train_df['PassengerId']
del train_df['PassengerId']
del train_df['Survived']

train_df

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
1,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...
887,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
891,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

> 답 : len

In [ ]:
train_df.isnull().sum() / len(train_df) * 100

Pclass       0.000000
Name         0.000000
Sex          0.000000
Age         19.865320
SibSp        0.000000
Parch        0.000000
Ticket       0.000000
Fare         0.000000
Cabin       77.104377
Embarked     0.224467
dtype: float64

In [ ]:
len(train_df)

891

__7. 첫 번째 데이터와 같이 숫자로 구성되어 있는 데이터셋을, 두 번째와 같이 카테고리 유형의 데이터셋 으로 변경하고자 한다.__  
__빈칸에 들어갈 적당한 매개변수를 선택하시오.__

In [ ]:
raw_data = {
    'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons',
                 'Scouts', 'Scouts', 'Scouts', 'Scouts'],
    'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd'],
    'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani',
             'Ali'],
    'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
    'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

df = pd.DataFrame(raw_data, columns=[
    'regiment', 'company', 'name', 'preTestScore', 'postTestScore'])
df

      regiment company      name  preTestScore  postTestScore
0   Nighthawks     1st    Miller             4             25
1   Nighthawks     1st  Jacobson            24             94
2   Nighthawks     2nd       Ali            31             57
3   Nighthawks     2nd    Milner             2             62
4     Dragoons     1st     Cooze             3             70
5     Dragoons     1st     Jacon             4             25
6     Dragoons     2nd    Ryaner            24             94
7     Dragoons     2nd      Sone            31             57
8       Scouts     1st     Sloan             2             62
9       Scouts     1st     Piger             3             70
10      Scouts     2nd     Riani             2             62
11      Scouts     2nd       Ali             3             70

1. cut 
2. bin 
3. get_dummies 
4. transform 

> 답 : 1  
> 연속형 데이터를 범주형 데이터로 변환하는 바인딩은 cut을 통해 가능

In [ ]:
bins = [0, 25, 50, 75, 100]  # Define bins as 0 to 25, 25 to 50, 60 to 75, 75 to 100
group_names = ['Low', 'Okay', 'Good', 'Great']
categories = pd.cut(df['postTestScore'], bins, labels=group_names)

categories

0       Low
1     Great
2      Good
3      Good
4      Good
5       Low
6     Great
7      Good
8      Good
9      Good
10     Good
11     Good
Name: postTestScore, dtype: category
Categories (4, object): ['Low' < 'Okay' < 'Good' < 'Great']